"""Таблица умножения
Домашнее задание
● Условие
На вход подается число n.
● Задача
Написать скрипт в любой парадигме, который выводит на экран таблицу умножения всех чисел от 1 до n.
Обоснуйте выбор парадигм.
● Пример вывода:
1 * 1 = 1
1 * 2 = 2
1 * 3 = 3
1 * 4 = 4
1 * 5 = 5
1 * 6 = 6
..
1 * 9 = 9"""


def multiplication_table(number: int):
    for i in range(1, number + 1):
        for j in range(1, number + 1):
            res = f"{j} X {i:>2} = {i * j:>2}"
            print(f"{res:<14}", end=" " * 2)
        print()


if __name__ == '__main__':
    n = int(input('ВВЕДИТЕ ЧИСЛО: '))
    print(f'\n******** ТАБЛИЦА УМНОЖЕНИЯ ОТ 1 до {n} ********\n')
    multiplication_table(n)
