"""Задача
Написать игру в “Крестики-нолики”. Можете использовать любые парадигмы, которые посчитаете наиболее
подходящими. Можете реализовать доску как угодно - как одномерный массив или двумерный массив (массив массивов).
Можете использовать как правила, так и хардкод, на своё усмотрение. Главное, чтобы в игру можно было поиграть через
терминал с вашего компьютера.
"""

from player import HumanPlayer, ComputerPlayer
from game import Game
from colorama import init, Fore

init(autoreset=True)


def main():
    # Создаем игроков
    player1 = HumanPlayer("Игрок 1", "X")  # Вариант игры человека в консоли
    # player1 = ComputerPlayer("Компьютер 1", "X")  # Игрок - компьютер
    player2 = ComputerPlayer("Компьютер 2", "O")  # Игрок - компьютер
    # Создаем игру
    game = Game(player1, player2)
    # Запускаем игру
    game.play()


if __name__ == "__main__":
    print(Fore.MAGENTA + '\n* КРЕСТИКИ-НОЛИКИ *')
    main()
